mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
/**
 * @file jm_stm32.c
 * @brief jm_stm32 协议栈核心实现
 *
 * 实现串口协议收发、事件分发、控制命令处理、MQTT 透传等功能。
 * 默认使用寄存器直驱（CMSIS）模式，HAL 模式可选。
 *
 * @copyright MIT
 */

#include "jm_stm32.h"
#include "jm_stm32_buf.h"

#include <string.h>

#if defined(USE_HAL_UART)
#include "stm32f1xx_hal.h"
#endif

/** @brief UART 接收环形缓冲区大小 */
#define JM_RX_RING_SIZE 256

#if JM_STM32_EVENT_ENABLE
static void jm_stm32_runEvent(void);
#endif
int jm_send_serial_packet(uint16_t subtype, uint16_t msg_id, const uint8_t *payload, uint16_t payload_len);

/**
 * @brief UART 接收环形缓冲区
 *
 * 用于在中断上下文快速存储从 ESP8266 接收的字节，
 * 主循环从中读取并喂给协议解析器。
 */
typedef struct {
    uint8_t buf[JM_RX_RING_SIZE];    /**< 缓冲区 */
    volatile uint16_t head;          /**< 写入指针 */
    volatile uint16_t tail;          /**< 读取指针 */
} jm_rx_ring_t;

/**
 * @brief 串口接收状态机
 *
 * 逐字节解析串口数据包， reassemble 完整后触发处理。
 */
typedef struct {
    uint32_t last_recv_time;    /**< 上次接收时间（用于超时清包） */
    jm_buf_t *assembling_buf;   /**< 正在组装的数据包缓冲区 */
    uint16_t data_size;         /**< 当前包的总数据大小 */
    uint16_t recv_size;         /**< 已接收的字节数 */
    uint8_t ds;                 /**< 状态机当前步骤 */
    uint8_t req_id;             /**< 请求 ID（从包头解析） */
    uint8_t ack_req_id;         /**< ACK 请求 ID */
    uint16_t wpos;              /**< 写入位置 */
    uint8_t cheader;            /**< 当前包头值 */
} jm_rx_state_t;

/**
 * @brief jm_stm32 全局上下文
 */
typedef struct {
    const jm_config_t *config;  /**< 用户配置 */
    jm_rx_state_t rx;           /**< 接收状态机 */
    bool initialized;           /**< 初始化标志 */
    bool wifi_enabled;          /**< WiFi 是否可用（由 ESP8266 上报） */
} jm_ctx_t;

static jm_ctx_t g_ctx;
static jm_rx_ring_t g_rx_ring;

/** @brief 全局请求 ID 计数器（0 和 1 保留） */
static uint8_t REQ_ID = 1;


/* ===================== 接收环形缓冲区 ===================== */

/**
 * @brief 将一个字节推入接收环形缓冲区
 * @param byte 待推入的字节
 * @return true 成功，false 缓冲区已满
 */
static inline bool jm_rx_ring_push(uint8_t byte)
{
    uint16_t next = (g_rx_ring.head + 1) % JM_RX_RING_SIZE;
    if (next == g_rx_ring.tail) return false;
    g_rx_ring.buf[g_rx_ring.head] = byte;
    g_rx_ring.head = next;
    return true;
}

/**
 * @brief 从接收环形缓冲区弹出一个字节
 * @param byte 输出字节
 * @return true 成功，false 缓冲区为空
 */
static inline bool jm_rx_ring_pop(uint8_t *byte)
{
    if (g_rx_ring.head == g_rx_ring.tail) return false;
    *byte = g_rx_ring.buf[g_rx_ring.tail];
    g_rx_ring.tail = (g_rx_ring.tail + 1) % JM_RX_RING_SIZE;
    return true;
}

/**
 * @brief 释放动态分配的字符串指针
 * @param s 字符串指针
 */
static void jm_free_string(char *s)
{
    if (s) free(s);
}

/**
 * @brief 分发事件到用户回调
 * @param event_type 事件类型
 * @param sub_type   子类型
 * @param data       事件数据
 */
static void jm_dispatch_event(uint8_t event_type, uint16_t sub_type, void *data)
{
    if (g_ctx.config && g_ctx.config->event_cb) {
        //JM_LOG_D("event_cb event_type=%d",event_type, sub_type);
        g_ctx.config->event_cb(event_type, sub_type, data, g_ctx.config->user_data);
    }
}

/**
 * @brief 根据 STM32 唯一 ID 哈希生成一个 32 位设备 ID
 * @return 设备 ID
 */
static uint32_t get_unique_id(void) {
    uint32_t a = *(volatile uint32_t *)0x1FFFF7E8;
    uint32_t b = *(volatile uint32_t *)0x1FFFF7EC;
    uint32_t c = *(volatile uint32_t *)0x1FFFF7F0;
    
    uint32_t h = 2166136261UL;
    h ^= a; h *= 16777619UL;
    h ^= b; h *= 16777619UL;
    h ^= c; h *= 16777619UL;
    return h;
}

/* ===================== emap（键值对）与控制命令 ===================== */

/** @brief 最大支持的控制命令函数数量 */
#define MAX_CTRL_FUNS 8

static jm_ctrl_item_t g_ctrl_reg[MAX_CTRL_FUNS];
static uint8_t g_ctrl_reg_count = 0;

/**
 * @brief 创建 emap 容器
 * @param type 容器类型
 * @return emap 指针，失败返回 NULL
 */
jm_emap_t *jm_emap_create(uint8_t type) {
    jm_emap_t *map = (jm_emap_t *)malloc(sizeof(jm_emap_t));
    if (map) {
        map->head = NULL;
        map->type = type;
    }
    return map;
}

/**
 * @brief 释放 emap 容器及所有节点
 * @param map emap 指针
 */
/**
 * @brief 释放 emap 容器及所有节点
 * @param map emap 指针
 */
void jm_emap_release(jm_emap_t *map) {
    if (!map) return;
    jm_emap_node_t *node = map->head;
    while (node) {
        //JM_LOG_D("4");
        jm_emap_node_t *next = node->next;
        //JM_LOG_D("5");
        if (node->copy_key && node->key) free(node->key);
        //JM_LOG_D("6");
        if (!node->is_int && node->copy_val && node->sval) free(node->sval);
        //JM_LOG_D("7");
        free(node);
        //JM_LOG_D("8");
        node = next;
        //JM_LOG_D("9");
    }
    free(map);
    //JM_LOG_D("10");
}

/**
 * @brief 添加整数键值对到 emap（内部接口，支持指定类型）
 * @param map     emap 容器
 * @param key     键名
 * @param val     整数值
 * @param type    前缀类型标识（PREFIX_TYPE_*）
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
static bool _jm_emap_putIntWithType(jm_emap_t *map, const char *key, int64_t val, uint8_t type, bool copyKey) {
    if (!map || !key) return false;
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0) {
            node->ival = val;
            node->type = type;
            return true;
        }
        node = node->next;
    }
    node = (jm_emap_node_t *)malloc(sizeof(jm_emap_node_t));
    if (!node) return false;
    node->key = copyKey ? strdup(key) : (char *)key;
    node->copy_key = copyKey;
    node->ival = val;
    node->is_int = true;
    node->type = type;
    node->sval = NULL;
    node->copy_val = false;
    node->next = map->head;
    map->head = node;
    return true;
}

/**
 * @brief 添加整数键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     整数值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putInt(jm_emap_t *map, const char *key, int32_t val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, (int64_t)val, PREFIX_TYPE_INT, copyKey);
}

/**
 * @brief 添加字符串键值对到 emap
 * @param map        emap 容器
 * @param key        键名
 * @param val        字符串值
 * @param needFreeMem 是否在释放 emap 时释放 val 内存
 * @param copyKey    是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putStr(jm_emap_t *map, const char *key, const char *val, bool needFreeMem, bool copyKey) {
    if (!map || !key) return false;
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0) {
            if (!node->is_int) {
                if (node->copy_val && node->sval) free(node->sval);
                node->sval = (char *)val;
                node->copy_val = needFreeMem;
            }
            return true;
        }
        node = node->next;
    }
    node = (jm_emap_node_t *)malloc(sizeof(jm_emap_node_t));
    if (!node) return false;
    node->key = copyKey ? strdup(key) : (char *)key;
    node->copy_key = copyKey;
    node->is_int = false;
    node->type = PREFIX_TYPE_STRINGG;
    node->sval = (char *)val;
    node->copy_val = needFreeMem;
    node->next = map->head;
    map->head = node;
    return true;
}

/**
 * @brief 添加字节（int8）键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     字节值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putByte(jm_emap_t *map, const char *key, int8_t val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, (int64_t)val, PREFIX_TYPE_BYTE, copyKey);
}

/**
 * @brief 添加字符键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     字符值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putChar(jm_emap_t *map, const char *key, char val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, (int64_t)(int8_t)val, PREFIX_TYPE_CHAR, copyKey);
}

/**
 * @brief 添加短整型（int16）键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     短整型值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putShort(jm_emap_t *map, const char *key, int16_t val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, (int64_t)val, PREFIX_TYPE_SHORTT_TYPE, copyKey);
}

/**
 * @brief 添加布尔值键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     布尔值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putBool(jm_emap_t *map, const char *key, bool val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, (int64_t)(val ? 1 : 0), PREFIX_TYPE_BOOLEAN, copyKey);
}

/**
 * @brief 添加长整型（int64）键值对到 emap
 * @param map     emap 容器
 * @param key     键名
 * @param val     长整型值
 * @param copyKey 是否复制 key 字符串
 * @return true 成功
 */
bool jm_emap_putLong(jm_emap_t *map, const char *key, int64_t val, bool copyKey) {
    return _jm_emap_putIntWithType(map, key, val, PREFIX_TYPE_LONG, copyKey);
}

/**
 * @brief 获取字节值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 字节值
 */
int8_t jm_emap_getByte(jm_emap_t *map, const char *key, int8_t def) {
    return (int8_t)jm_emap_getInt(map, key, (int32_t)def);
}

/**
 * @brief 获取字符值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 字符值
 */
char jm_emap_getChar(jm_emap_t *map, const char *key, char def) {
    return (char)jm_emap_getInt(map, key, (int32_t)(int8_t)def);
}

/**
 * @brief 获取短整型值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 短整型值
 */
int16_t jm_emap_getShort(jm_emap_t *map, const char *key, int16_t def) {
    return (int16_t)jm_emap_getInt(map, key, (int32_t)def);
}

/**
 * @brief 获取布尔值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 布尔值
 */
bool jm_emap_getBool(jm_emap_t *map, const char *key, bool def) {
    return jm_emap_getInt(map, key, (int32_t)(def ? 1 : 0)) != 0;
}

/**
 * @brief 获取长整型值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 长整型值
 */
int64_t jm_emap_getLong(jm_emap_t *map, const char *key, int64_t def) {
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0 && node->is_int) {
            return node->ival;
        }
        node = node->next;
    }
    return def;
}

/**
 * @brief 获取整数值
 * @param map  emap 容器
 * @param key  键名
 * @param def  默认值
 * @return 整数值
 */
int32_t jm_emap_getInt(jm_emap_t *map, const char *key, int32_t def) {
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0 && node->is_int) {
            return node->ival;
        }
        node = node->next;
    }
    return def;
}

/**
 * @brief 获取字符串值
 * @param map  emap 容器
 * @param key  键名
 * @return 字符串指针，键不存在返回 NULL
 */
char *jm_emap_getStr(jm_emap_t *map, const char *key) {
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0 && !node->is_int) {
            return node->sval;
        }
        node = node->next;
    }
    return NULL;
}

/**
 * @brief 检查键是否存在
 * @param map  emap 容器
 * @param key  键名
 * @return true 存在
 */
bool jm_emap_exist(jm_emap_t *map, const char *key) {
    jm_emap_node_t *node = map->head;
    while (node) {
        if (strcmp(node->key, key) == 0) {
            return true;
        }
        node = node->next;
    }
    return false;
}

/**
 * @brief 将 emap 序列化到缓冲区
 * @param map emap 容器
 * @param buf 目标缓冲区
 * @return true 成功
 */
bool jm_emap_encode(const jm_emap_t *map, jm_buf_t *buf) {
    if (!map || !buf) return false;
    if (!jm_buf_put_s8(buf, PREFIX_TYPE_MAP)) return false;
    uint8_t count = 0;
    jm_emap_node_t *node = map->head;
    while (node) { count++; node = node->next; }
    if (!jm_buf_put_s16(buf, (int16_t)count)) return false;
    if (!jm_buf_put_s8(buf, PREFIX_TYPE_STRINGG)) return false;
    node = map->head;
    while (node) {
        if (!jm_buf_write_string(buf, node->key, (uint16_t)strlen(node->key))) return false;
        if (node->is_int) {
            if (!jm_buf_put_s8(buf, (int8_t)node->type)) return false;
            switch (node->type) {
                case PREFIX_TYPE_BOOLEAN:
                    if (!jm_buf_put_bool(buf, (bool)node->ival)) return false;
                    break;
                case PREFIX_TYPE_CHAR:
                    if (!jm_buf_put_s8(buf, (int8_t)node->ival)) return false;
                    break;
                case PREFIX_TYPE_BYTE:
                    if (!jm_buf_put_s8(buf, (int8_t)node->ival)) return false;
                    break;
                case PREFIX_TYPE_SHORTT_TYPE:
                    if (!jm_buf_put_s16(buf, (int16_t)node->ival)) return false;
                    break;
                case PREFIX_TYPE_LONG:
                    if (!jm_buf_put_s64(buf, node->ival)) return false;
                    break;
                case PREFIX_TYPE_INT:
                default:
                    if (!jm_buf_put_s32(buf, (int32_t)node->ival)) return false;
                    break;
            }
        } else {
            if (!jm_buf_put_s8(buf, PREFIX_TYPE_STRINGG)) return false;
            uint16_t sval_len = node->sval ? (uint16_t)strlen(node->sval) : 0;
            if (!jm_buf_write_string(buf, node->sval ? node->sval : "", sval_len)) return false;
        }
        node = node->next;
    }
    return true;
}

/**
 * @brief 从字节数据反序列化为 emap
 * @param data 序列化数据
 * @param len  数据长度
 * @return emap 指针（调用者需释放），失败返回 NULL
 */
jm_emap_t *jm_emap_decode(const uint8_t *data, uint16_t len) {
    if (!data || len < 4) {JM_LOG_M("MDN");return NULL;}

    jm_buf_t *buf = jm_buf_wrap_array(data, len);
    if (!buf) return NULL;

    int8_t type = 0;
    if (!jm_buf_get_s8(buf, &type)) {
        jm_buf_release(buf);
        JM_LOG_M("MTIN");
        return NULL;
    }

    jm_emap_t *map = jm_emap_create(0);
    if (!map) {
        jm_buf_release(buf);
        JM_LOG_M("MCMF");
        return NULL;
    }

    int16_t eleLen = 0;
    if (!jm_buf_get_s16(buf, &eleLen)) {
        jm_emap_release(map);
        jm_buf_release(buf);
        JM_LOG_M("MGLE");
        return NULL;
    }

    if (eleLen <= 0) {
        jm_buf_release(buf);
        JM_LOG_M("MIEL");
        return map;
    }

    int8_t keyType = 0;
    if (!jm_buf_get_s8(buf, &keyType)) {
        jm_emap_release(map);
        jm_buf_release(buf);
        JM_LOG_M("MKE");
        return NULL;
    }

