mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
    for (int16_t i = 0; i < eleLen; i++) {
        int8_t flag = 0;
        char *key = jm_buf_read_string(buf, &flag);
        if (!key || flag <= 0) {
            jm_emap_release(map);
            jm_buf_release(buf);
            JM_LOG_M("MIKE");
            return NULL;
        }

        int8_t type = 0;
        if (!jm_buf_get_s8(buf, &type)) {
            free(key);
            jm_emap_release(map);
            jm_buf_release(buf);
             JM_LOG_M("MVE");
            return NULL;
        }

        switch (type) {
            case PREFIX_TYPE_INT: {
                int32_t val = 0;
                if (!jm_buf_get_s32(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                    JM_LOG_M("MVEI");
                    return NULL;
                }
                jm_emap_putInt(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_BYTE: {
                int8_t val = 0;
                if (!jm_buf_get_s8(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                     JM_LOG_M("MVEB");
                    return NULL;
                }
                jm_emap_putByte(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_SHORTT_TYPE: {
                int16_t val = 0;
                if (!jm_buf_get_s16(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                    JM_LOG_M("MVESH");
                    return NULL;
                }
                jm_emap_putShort(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_LONG: {
                int64_t val = 0;
                if (!jm_buf_get_s64(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                    JM_LOG_M("MVELG");
                    return NULL;
                }
                jm_emap_putLong(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_BOOLEAN: {
                bool val = false;
                if (!jm_buf_get_bool(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                    JM_LOG_M("MVEBL");
                    return NULL;
                }
                jm_emap_putBool(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_CHAR: {
                char val = 0;
                if (!jm_buf_get_char(buf, &val)) {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                    JM_LOG_M("MVECH");
                    return NULL;
                }
                jm_emap_putChar(map, key, val, true);
                break;
            }
            case PREFIX_TYPE_STRINGG: {
                int8_t sflag = 0;
                char *sval = jm_buf_read_string(buf, &sflag);
                if (sflag > 0 && sval) {
                    jm_emap_putStr(map, key, sval, true, true);
                } else if (sflag == 0) {
                    jm_emap_putStr(map, key, "", false, true);
                } else {
                    free(key);
                    jm_emap_release(map);
                    jm_buf_release(buf);
                     JM_LOG_M("MVES");
                    return NULL;
                }
                break;
            }
            default:
                JM_LOG_M("MVNS=%d",type);
                break;
        }

        free(key);
    }

    jm_buf_release(buf);
    return map;
}

/**
 * @brief 注册控制命令处理函数
 * @param fn    处理函数
 * @param defId 命令 ID
 * @return true 成功，false 失败或已达上限
 */
/**
 * @brief 注册控制命令处理函数
 * @param fn    处理函数
 * @param defId 命令 ID
 * @return true 成功，false 失败或已达上限
 */
bool jm_ctrl_registFun(jm_ctrl_fn_t fn, int32_t defId) {
    if (!fn || g_ctrl_reg_count >= MAX_CTRL_FUNS) return false;
    for (int i = 0; i < g_ctrl_reg_count; i++) {
        if (g_ctrl_reg[i].defId == defId) return false;
    }
    g_ctrl_reg[g_ctrl_reg_count].defId = defId;
    g_ctrl_reg[g_ctrl_reg_count].fn = fn;
    g_ctrl_reg_count++;
    return true;
}

/**
 * @brief 返回"命令未找到"错误响应
 * @return 包含 code=2 和 msg="method not found" 的 emap
 */
static jm_emap_t *jm_ctrl_not_found(void) {
    jm_emap_t *rst = jm_emap_create(0);
    if (rst) {
        jm_emap_putInt(rst, "code", 2, false);
        jm_emap_putStr(rst, "msg", "method not found", false, false);
    }
    return rst;
}

/**
 * @brief 调用控制命令处理函数
 * @param ps 包含 funName/_fn 字段的 emap 参数
 * @return 处理结果 emap，调用者需释放
 */
jm_emap_t *jm_ctrl_invokeFunc(jm_emap_t *ps) {
    if (!ps) return NULL;

    int32_t defId = jm_emap_getInt(ps, "funName", 0);
    if (!defId) {
        defId = jm_emap_getInt(ps, "_fn", 0);
    }

    JM_LOG_D("defId=%d",defId);
    if (!defId) {
        return jm_stm32_ctrl_def(ps);
    }

    for (int i = 0; i < g_ctrl_reg_count; i++) {
        if (g_ctrl_reg[i].defId == defId) {
            return g_ctrl_reg[i].fn(ps);
        }
    }

    //JM_LOG_D("defP=%d",defId);
    return jm_ctrl_not_found();
}

/* ===================== End map ===================== */

/**
 * @brief 解析串口控制命令数据包（Type=3）
 *
 * 解析从 ESP8266 收到的串口控制命令，根据子类型派发相应事件。
 *
 * @param payload     数据负载（跳过包头后的内容）
 * @param payload_len 负载长度
 */
static void jm_parse_serial_packet(const uint8_t *payload, uint16_t payload_len)
{
    if (payload_len < 8) {
        JM_LOG_E("pl8=%d",payload_len);  
        return;
    }

    if (payload[0] != 0 || payload[1] != 0) {
        JM_LOG_E("p[0]=%d 1=%d",payload[0],payload[1]);  
        return;
    }
    if (payload[2] != JM_SDADA_CHECK_NUM) {
        JM_LOG_E("p2NC=%d",payload[2]);  
        return;
    }
    if (payload[3] != JM_SERIALNET_TYPE_SERIAL) {
        JM_LOG_E("p3NS=%d",payload[3]);  
        return;
    }

    uint16_t subtype = ((uint16_t)payload[4] << 8) | payload[5];
    uint16_t req_id = ((uint16_t)payload[6] << 8) | payload[7];
    (void)req_id;
    uint16_t data_len = payload_len - 8;
    const uint8_t *data = &payload[8];

    jm_buf_t *buf = jm_buf_wrap_array(data, data_len);
    if (!buf) {
        JM_LOG_E("BME=%d", data_len);
        return;
    }

    JM_LOG_D("subtype=%d", subtype);
    switch (subtype) {
    case JM_TASK_APP_PROXY_WIFI_CONNECTED: {
        JM_LOG_D("wifiE");
        jm_wifi_status_t status;
        memset(&status, 0, sizeof(status));
        jm_buf_get_u32(buf, &status.devId);
        jm_buf_get_bool(buf, &status.wifi_enabled);
        jm_buf_get_bool(buf, &status.isLogin);
        g_ctx.wifi_enabled = status.wifi_enabled;
        jm_dispatch_event(JM_EVENT_WIFI_STATUS, subtype, &status);
        break;
    }

