mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
    case JM_TASK_APP_PROXY_HB:
    case JM_TASK_APP_PROXY_INTERNET_ENABLE:
    case JM_TASK_APP_PROXY_WIFI_IS_ENABLE: {
        jm_wifi_status_t status;
        memset(&status, 0, sizeof(status));
        jm_buf_get_u32(buf, &status.devId);
        jm_buf_get_bool(buf, &status.wifi_enabled);
        jm_buf_get_bool(buf, &status.isLogin);
        g_ctx.wifi_enabled = status.wifi_enabled;
        jm_dispatch_event(JM_EVENT_INTERNET_STATUS, subtype, &status);
        //JM_LOG_D("HB IE WIS we=%d lo=%d did=%d", status.wifi_enabled, status.isLogin, status.devId);
       
        //uint16_t subtype, uint16_t msg_id, const uint8_t *payload, uint16_t payload_len
        if(JM_TASK_APP_PROXY_HB == subtype) {
            JM_LOG_D("resp HB");
            jm_send_serial_packet(subtype, 0, NULL, 0);  //给网卡一个同类形的响应，以表示主机还活着
        }
        break;
    }

    case JM_TASK_APP_PROXY_UID: {
        JM_LOG_D("puid");
        jm_stm32_send_uid();
        break;
    }

    case JM_TASK_APP_PROXY_LOGIN_RESULT: {
        JM_LOG_D("login");
        jm_login_result_t result;
        memset(&result, 0, sizeof(result));
        jm_buf_get_s32(buf, &result.login_code);
        jm_buf_get_u32(buf, &result.dev_uid);
        jm_buf_get_s32(buf, &result.act_id);
        jm_buf_get_s32(buf, &result.client_id);
        jm_buf_get_s8(buf, &result.grp_id);
        int8_t flag = 0;
        char *key = jm_buf_read_string(buf, &flag);
        if (key && flag > 0) {
            strncpy(result.login_key, key, sizeof(result.login_key) - 1);
            jm_free_string(key);
        }

        jm_stm32_send_uid();

        jm_dispatch_event(JM_EVENT_LOGIN_RESULT, subtype, &result);
        break;
    }

#if JM_STM32_TCP_ENABLE==1
    case JM_TASK_APP_PROXY_TCP_CONNECTED:
    case JM_TASK_APP_PROXY_TCP_DISCONNECTED:
    case JM_TASK_APP_PROXY_TCP_SEND:
    case JM_TASK_APP_PROXY_TCP_ERR: {
        JM_LOG_D("TCP");
        jm_tcp_conn_info_t conn;
        memset(&conn, 0, sizeof(conn));
        int8_t sflag = 0;
        char *host = jm_buf_read_string(buf, &sflag);
        jm_buf_get_u16(buf, &conn.port);
        jm_buf_get_s8(buf, &conn.sock);
        if (host && sflag > 0) {
            strncpy(conn.host, host, sizeof(conn.host) - 1);
            jm_free_string(host);
        }
        if (subtype == JM_TASK_APP_PROXY_TCP_SEND || subtype == JM_TASK_APP_PROXY_TCP_ERR) {
            jm_buf_get_s8(buf, &conn.err_code);
            if (conn.err_code < 0) {
                char *err = jm_buf_read_string(buf, &sflag);
                if (err && sflag > 0) {
                    strncpy(conn.err_msg, err, sizeof(conn.err_msg) - 1);
                    jm_free_string(err);
                }
            }
        }
        uint8_t evt = 0;
        switch (subtype) {
        case JM_TASK_APP_PROXY_TCP_CONNECTED: evt = JM_EVENT_TCP_CONNECTED; break;
        case JM_TASK_APP_PROXY_TCP_DISCONNECTED: evt = JM_EVENT_TCP_DISCONNECTED; break;
        case JM_TASK_APP_PROXY_TCP_SEND: evt = JM_EVENT_TCP_SEND_RESULT; break;
        case JM_TASK_APP_PROXY_TCP_ERR: evt = JM_EVENT_TCP_ERROR; break;
        }
         JM_LOG_D("TCPE");
        jm_dispatch_event(evt, subtype, &conn);
        break;
    }
#endif //#if JM_STM32_TCP_ENABLE==1


    case JM_TASK_APP_PROXY_SYS_CFG: {
        JM_LOG_D("sysCfg");
        jm_sys_cfg_t cfg;
        memset(&cfg, 0, sizeof(cfg));
        uint16_t avail = jm_buf_readable_len(buf);
        if (avail > sizeof(cfg.data)) avail = sizeof(cfg.data);
        jm_buf_get_bytes(buf, cfg.data, avail);
        cfg.len = avail;
        jm_dispatch_event(JM_EVENT_SYS_CFG, subtype, &cfg);
        break;
    }
    case JM_TASK_APP_PROXY_TRANS_CMD: {
         JM_LOG_D("transCmd");
        uint16_t data_len = jm_buf_readable_len(buf);
        if (data_len > 0) {
            uint8_t *data = (uint8_t *)malloc(data_len);
            if (data) {
                jm_buf_get_bytes(buf, data, data_len);
                jm_dispatch_event(JM_EVENT_TRANS_CMD, subtype, data);
                free(data);
            }
        }
        break;
    }
    case JM_TASK_APP_PROXY_CTRL_EVENT: {
        JM_LOG_D("ctrlEvt");
        uint16_t data_len = jm_buf_readable_len(buf);
        if (data_len > 0) {
            uint8_t *data = (uint8_t *)malloc(data_len);
            if (data) {
                jm_buf_get_bytes(buf, data, data_len);
                jm_dispatch_event(JM_EVENT_CTRL_EVENT, subtype, data);
                free(data);
            }
        }
        break;
    }
    case JM_TASK_APP_PROXY_CTRL_CMD: {
        JM_LOG_D("ctrlCmd reqId=%u", req_id);
        uint16_t data_len = jm_buf_readable_len(buf);
         JM_LOG_D("dl=%u", data_len);
        if (data_len > 0) {
            const uint8_t *data = jm_buf_read_buf(buf);

            //JM_LOG_D("dcb=%p", data);
            jm_emap_t *ps = jm_emap_decode(data, data_len);
            if (ps) {
               // JM_LOG_D("ivf");
                jm_emap_t *rst = jm_ctrl_invokeFunc(ps);
                // JM_LOG_D("ivfR");
                if (rst) {
                    if (req_id > 0) {
                         JM_LOG_D("crst");
                        jm_stm32_send_ctrl_rst(req_id, rst);
                    }
                    //  JM_LOG_D("1");
                    jm_emap_release(rst);
                }else {
                    JM_LOG_D("NRSt");
                }
                //  JM_LOG_D("2");
                jm_emap_release(ps);
                 // JM_LOG_D("3");
            }else {
                JM_LOG_E("PS N");
            }
        }else {
            JM_LOG_E("Data N");
        }
        JM_LOG_D("ctrlE");
        break;
    }

#if JM_STM32_EVENT_ENABLE
    case JM_TASK_APP_PROXY_NETCARD_EVENT:
		{
			uint8_t flag = 0;
			if(!jm_buf_get_u8(buf, &flag)) {
				JM_LOG_E("evtFErr");
				return;
			}

			uint8_t eventType = 0;
			if(!jm_buf_get_u8(buf, &eventType)) {
				JM_LOG_E("evtTErr");
				return;
			}

			uint8_t evtSubType = 0;
			if(!jm_buf_get_u8(buf, &evtSubType)) {
				JM_LOG_E("evtSTErr");
				return;
			}

			flag = flag|JM_EVENT_FLAG_FROM_NETCARD|JM_EVENT_FLAG_FREE_EMAP;

