mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
			JM_LOG_D("hEvent type=%u evtSubType=%u flag=%u ",eventType, evtSubType,flag);

			jm_emap_t *ps = jm_emap_decode(buf->data, jm_buf_readable_len(buf));
			jm_stm32_postEvent(eventType, evtSubType, ps , flag);

		}
		break;
#endif //#if JM_STM32_EVENT_ENABLE

#if JM_STM32_INTERRUPT_ENABLE
    case JM_TASK_APP_PROXY_NETCARD_INTERRUPT:
		{
            //jm_buf_put_u8(hbuf,1);//注册引脚中断
            //jm_buf_put_u16(hbuf,pin);
            // jm_buf_put_u8(hbuf,triggerType);
            uint8_t opType = 1; //1注册引脚中断， 2：取消注册的引脚中断
            uint16_t pin = 0; //要注册中断的引用
			uint8_t triggerType = 0; //引发引脚中断类型与Arduino的引脚中断类型相同，如上升沿，下降沿等

			if(!jm_buf_get_u8(buf, &opType)) {
				JM_LOG_E("inteErr");
				return;
			}

            if(!jm_buf_get_u16(buf, &pin)) {
				JM_LOG_E("inteErr");
				return;
			}

            if(opType == 1 && !jm_buf_get_u8(buf, &triggerType)) {
				JM_LOG_E("inteErr");
				return;
			}

            if(opType == 1) {
                jm_stm32_registerPinInterrupt(pin, triggerType);
            }else if(opType == 2) {
                jm_stm32_unregisterPinInterrupt(pin);
            }
            
		}
		break;
#endif //#if JM_STM32_INTERRUPT_ENABLE

    default:
        break;
    }

    jm_buf_release(buf);

    //JM_LOG_D("SPE");
}

/**
 * @brief 获取系统运行时间（毫秒）
 * @return 系统毫秒时间，未初始化返回 0
 */
uint32_t jm_stm32_get_time(void) {
    if (g_ctx.initialized && g_ctx.config && g_ctx.config->get_sys_time_ms) {
        return g_ctx.config->get_sys_time_ms();
    }
    return 0;
}

/**
 * @brief 初始化 jm_stm32 库
 *
 * 初始化全局上下文、接收缓冲区，并调用 @ref jm_comp_init 初始化子组件。
 * 必须在调用其他 API 前完成一次。
 *
 * @param config 用户配置结构体
 * @return @ref JM_SUCCESS 成功，@ref JM_ERR_NOT_READY 配置无效
 */
int jm_stm32_init(const jm_config_t *config)
{
    if (!config || !config->get_sys_time_ms || !config->uart_send) {
        JM_LOG_LINE("InvCfg");
        return JM_ERR_NOT_READY;
    }

    memset(&g_ctx, 0, sizeof(g_ctx));
    memset(&g_rx_ring, 0, sizeof(g_rx_ring));
    g_ctx.config = config;
    g_ctx.initialized = true;

    jm_log_char('i'); jm_log_char('n'); jm_log_char('i'); jm_log_char('t'); jm_log_char(' '); jm_log_char('s'); jm_log_char('t'); jm_log_char('m'); jm_log_char('3'); jm_log_char('2'); jm_log_char('\n');

    if (g_ctx.config->uart_send_log) {
        g_ctx.config->uart_send_log((const uint8_t*)"log_test_ok\r\n", 14);
    }

    if (g_ctx.config->uart_send_log) {
        g_ctx.config->uart_send_log((const uint8_t*)"after_log_test\r\n", 16);
    }

    jm_log_char('b'); jm_log_char('e'); jm_log_char('f'); jm_log_char('o'); jm_log_char('r'); jm_log_char('e'); jm_log_char(' '); jm_log_char('c'); jm_log_char('o'); jm_log_char('m'); jm_log_char('p'); jm_log_char('_'); jm_log_char('i'); jm_log_char('n'); jm_log_char('i'); jm_log_char('t'); jm_log_char('\n');
    jm_comp_init(config);
    JM_LOG_LINE("after comp_init");

    JM_LOG_LINE("before wifi_req");
    jm_stm32_send_wifi_status_req();
    JM_LOG_LINE("after wifi_req");

    JM_LOG_LINE("init end");

    return JM_SUCCESS;
}

/**
 * @brief jm_stm32 主轮询函数
 *
 * 从接收环形缓冲区读取所有已接收的字节并喂给协议解析器，
 * 调用 @ref jm_comp_loop 处理子组件，处理异步事件队列。
 * 应在主循环中周期性调用。
 */
void jm_stm32_loop(void)
{
    if (!g_ctx.initialized) return;

    uint8_t byte;
    while (jm_rx_ring_pop(&byte)) {
        jm_stm32_uart_rx_byte(byte);
    }

    jm_comp_loop();

#if JM_STM32_EVENT_ENABLE
    jm_stm32_runEvent();
#endif

}

/* ===================== UART 接收处理 ===================== */

/**
 * @brief 将接收到的 UART 字节推入接收环形缓冲区
 *
 * 寄存器直驱模式下，UART 中断服务函数调用本函数存储字节。
 * 主循环通过 @ref jm_stm32_loop 读取并处理这些字节。
 *
 * @param byte 收到的字节
 * @return true 推入成功，false 缓冲区已满
 */
bool jm_stm32_uart_push_byte(uint8_t byte)
{
    return jm_rx_ring_push(byte);
}

/**
 * @brief 直接处理一个 UART 字节（不经过环形缓冲区）
 *
 * 逐字节解析串口协议， reassemble 完成后自动分发事件或派发给 @ref jm_parse_serial_packet。
 * 包括包头同步、长度解析、校验、超时清包等逻辑。
 *
 * @param byte 收到的字节
 */
void jm_stm32_uart_rx_byte(uint8_t byte)
{
    if (!g_ctx.initialized) return;

    uint32_t now = g_ctx.config->get_sys_time_ms();

    if (g_ctx.rx.last_recv_time > 0 && (now - g_ctx.rx.last_recv_time) > 3000) {
        if (g_ctx.rx.assembling_buf) {
            jm_buf_clear(g_ctx.rx.assembling_buf);
        }
        g_ctx.rx.data_size = 0;
        g_ctx.rx.recv_size = 0;
        g_ctx.rx.ds = 0;
        g_ctx.rx.req_id = 0;
        g_ctx.rx.wpos = 0;
        g_ctx.rx.cheader = 0;
         JM_LOG_D("ClsBuf");
    }
    g_ctx.rx.last_recv_time = now;

    if (g_ctx.rx.ds == 0) {
        if(g_ctx.rx.cheader == PCK_HEANDER) {
            g_ctx.rx.data_size = (uint16_t)byte << 8;
            g_ctx.rx.ds = 1;
            g_ctx.rx.cheader =0;
        } else {
            //JM_LOG_D("GPH %x",byte);
            g_ctx.rx.cheader = byte;
        }
        return;
    }

    if (g_ctx.rx.ds == 1) {
        g_ctx.rx.data_size |= byte;
        if (g_ctx.rx.data_size > JM_MAX_SERIAL_BLOCK_SIZE || g_ctx.rx.data_size == 0) {
            g_ctx.rx.last_recv_time = 1;
            return;
        }
        g_ctx.rx.ds = 2;
        return;
    }

    if (g_ctx.rx.ds == 2) {
        g_ctx.rx.req_id = byte;
        g_ctx.rx.ds = 3;
        return;
    }

    if (g_ctx.rx.req_id == 0) {
        if (g_ctx.rx.data_size != 1) {
            g_ctx.rx.last_recv_time = 1;
            JM_LOG_D("InvPck");
            return;
        }

        //JM_LOG_D("Gcpk=%d",byte);
        g_ctx.rx.ack_req_id = byte;
        g_ctx.rx.data_size = 0;
        g_ctx.rx.recv_size = 0;
        g_ctx.rx.ds = 0;
        g_ctx.rx.req_id = 0;
        g_ctx.rx.cheader = 0;
        return;
    }

    if (!g_ctx.rx.assembling_buf) {
        g_ctx.rx.assembling_buf = jm_buf_create(g_ctx.rx.data_size);
        if (!g_ctx.rx.assembling_buf) {
            g_ctx.rx.data_size = 0;
            g_ctx.rx.recv_size = 0;
            g_ctx.rx.ds = 0;
            g_ctx.rx.req_id = 0;
            JM_LOG_E("MER");
            return;
        }
    }

    if (!jm_buf_put_u8(g_ctx.rx.assembling_buf, byte)) {
        jm_buf_release(g_ctx.rx.assembling_buf);
        g_ctx.rx.assembling_buf = NULL;
        g_ctx.rx.last_recv_time = 1;
        return;
    }

    g_ctx.rx.recv_size++;

