mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
    if (g_ctx.rx.recv_size == g_ctx.rx.data_size) {
        
        if (g_ctx.rx.req_id > 1) {
           // jm_delay_ms(2);
            uint8_t ack_pkt[] = {PCK_HEANDER, 0, 1, 0, g_ctx.rx.req_id};
            g_ctx.config->uart_send(ack_pkt, sizeof(ack_pkt));
           // g_ctx.config->uart_send(ack_pkt, sizeof(ack_pkt));
            //JM_LOG_D("cfp %d s=%d",g_ctx.rx.req_id,sizeof(ack_pkt) );

            //for (volatile int i = 0; i < 5000; i++);

           // __DSB();  // Data Synchronization Barrier
           // __ISB();  // Instruction Synchronization Barrier

        } else {
            //JM_LOG_D("noCfg %d",g_ctx.rx.req_id );
        }

        //JM_LOG_D("oP %d",g_ctx.rx.req_id);
        g_ctx.rx.cheader = 0; //重置包头

        uint16_t payload_len = jm_buf_readable_len(g_ctx.rx.assembling_buf);
        const uint8_t *payload = jm_buf_read_buf(g_ctx.rx.assembling_buf);

         if (payload_len >= 8 && payload[0] == 0 && payload[1] == 0 && payload[2] == JM_SDADA_CHECK_NUM && payload[3] == JM_SERIALNET_TYPE_SERIAL) {
             JM_LOG_D("seCmd %d",payload[3]);
             jm_parse_serial_packet(payload, payload_len);
         } else if (payload_len >= 3 && payload[0] == 0 && payload[2] == JM_SDADA_CHECK_NUM) {
             uint8_t type = payload[3];
             uint8_t evt_type = 0;
           
              if(false) ;
#if JM_STM32_TCP_ENABLE==1
              else if (type == JM_SERIALNET_TYPE_TCP) {
                 if (!g_ctx.wifi_enabled) {
                     JM_LOG_D("tcp drop wifi not ready");
                 } else {
                     //evt_type = JM_EVENT_TCP_DATA;
                      jm_buf_t *buf = jm_buf_wrap_array(payload, payload_len);
                      if (buf) {
                         jm_onTcpEvent(JM_EVENT_TCP_DATA,buf);
                         g_ctx.rx.assembling_buf = NULL;
                         g_ctx.rx.data_size = 0;
                         g_ctx.rx.recv_size = 0;
                         g_ctx.rx.ds = 0;
                         g_ctx.rx.req_id = 0;
                         g_ctx.rx.wpos = 0;
                         jm_buf_release(buf);
                         return;
                      }
                 }
              }
#endif //#if JM_STM32_TCP_ENABLE==1

#if JM_STM32_UDP_ENABLE==1
              else if (type == JM_SERIALNET_TYPE_UDP || type == JM_SERIALNET_TYPE_UDP_COM) {
                if (!g_ctx.wifi_enabled) {
                     JM_LOG_D("udp drop wifi not ready");
                } else {
                // evt_type = JM_EVENT_UDP_DATA;
                     jm_buf_t *buf = jm_buf_wrap_array(payload, payload_len);
                     if (buf) {
                         jm_onUdpData(buf);
                         g_ctx.rx.assembling_buf = NULL;
                         g_ctx.rx.data_size = 0;
                         g_ctx.rx.recv_size = 0;
                         g_ctx.rx.ds = 0;
                         g_ctx.rx.req_id = 0;
                         g_ctx.rx.wpos = 0;
                         return;
                     }
                }
            }
#endif //#if JM_STM32_UDP_ENABLE==1


#if JM_MQTT_CLIENT_ENABLE
              else if (type == JM_SERIALNET_TYPE_MQTT) {
                  if (!g_ctx.wifi_enabled) {
                      JM_LOG_D("mqtt drop wifi not ready");
                  } else {
                      jm_mqtt_client_on_serial_data(payload + 4, payload_len - 4);
                      g_ctx.rx.assembling_buf = NULL;
                      g_ctx.rx.data_size = 0;
                      g_ctx.rx.recv_size = 0;
                      g_ctx.rx.ds = 0;
                      g_ctx.rx.req_id = 0;
                      g_ctx.rx.wpos = 0;
                      return;
                  }
              }
#endif //JM_MQTT_CLIENT_ENABLE

#if JM_HTTP_CLIENT_ENABLE
              else if (type == JM_SERIALNET_TYPE_HTTP) {
                  if (!g_ctx.wifi_enabled) {
                      JM_LOG_D("http drop wifi not ready");
                  } else {
                      jm_http_client_on_serial_data(payload + 4, payload_len - 4);
                      g_ctx.rx.assembling_buf = NULL;
                      g_ctx.rx.data_size = 0;
                      g_ctx.rx.recv_size = 0;
                      g_ctx.rx.ds = 0;
                      g_ctx.rx.req_id = 0;
                      g_ctx.rx.wpos = 0;
                      return;
                  }
              }
#endif //JM_HTTP_CLIENT_ENABLE

             JM_LOG_D("got type=%d evt_type=%d",type, evt_type);

             if (evt_type != 0) {
                 jm_buf_t *buf = jm_buf_wrap_array(payload, payload_len);
                 if (buf) {
                     JM_LOG_D("dispatch dl=%d evt_type=%d", payload_len, evt_type);
                     jm_dispatch_event(evt_type, 0, buf);
                     jm_buf_release(buf);
                 }
             }
         } else {

            JM_LOG_D("NSP Type dl=%d",payload_len);
            jm_buf_t *buf = jm_buf_wrap_array(payload, payload_len);
            if (buf) {
                JM_LOG_D("disp tcp data dl=%d",payload_len);
                jm_dispatch_event(JM_EVENT_TCP_DATA, 0, buf);
                jm_buf_release(buf);
            }
        }

        jm_buf_release(g_ctx.rx.assembling_buf);
        g_ctx.rx.assembling_buf = NULL;
        g_ctx.rx.data_size = 0;
        g_ctx.rx.recv_size = 0;
        g_ctx.rx.ds = 0;
        g_ctx.rx.req_id = 0;
        g_ctx.rx.wpos = 0;

        //JM_LOG_D("POE");
    }
}

/**
 * @brief 获取下一个请求 ID（自动递增）
 *
 * 请求 ID 0 和 1 保留，0 表示 ACK 包，1 保留。
 * 当计数器溢出（达到 255 后溢出为 0）时，会重置为 2。
 *
 * @return 下一个请求 ID
 */
uint8_t jm_stm32_next_req_id(void) {
    uint8_t reqId =  ++REQ_ID;
	if(reqId==0) {
		//确保reqId不等于0或1
		reqId = REQ_ID = 2;
	}
    return reqId;
 }

/* ===================== 发送数据包 API ===================== */

/**
 * @brief 创建发送缓冲区（包含串口包头）
 *
 * 构建数据包：[0, 0, 0x55, type] 后跟用户数据。
 * 两个 0 长度字节表示不分片（本地包长度不超过 JM_MAX_SERIAL_BLOCK_SIZE）。
 *
 * @param type 包类型（@ref JM_SERIALNET_TYPE_*）
 * @param size 用户数据大小
 * @return 缓冲区指针，失败返回 NULL
 */
jm_buf_t* jm_other_buf(uint8_t type, uint16_t size) {

 	jm_buf_t *hbuf = jm_buf_create(size+5);
 	if(hbuf == NULL) {
 		JM_LOG_E("hbuf N");
 		return NULL;
 	}
 	//两个0总长度表示不拆包，也就是本地命令包长度不能大于JM_MAX_SERIAL_BLOCK_SIZE
 	jm_buf_put_u8(hbuf, 0);
 	jm_buf_put_u8(hbuf, 0);
 	jm_buf_put_u8(hbuf, JM_SDADA_CHECK_NUM); // 用于校验数据合法性
 	jm_buf_put_u8(hbuf, type);
 	return hbuf;
}

/**
 * @brief 发送非串口控制类型的其它数据包
 * @param type        包类型
 * @param payload     数据负载
 * @param payload_len 负载长度
 * @return @ref JM_SUCCESS 成功
 */
/*
static int jm_send_other_packet(uint8_t type, const uint8_t *payload, uint16_t payload_len)
{
    if (!g_ctx.initialized || !g_ctx.config->uart_send) {
        JM_LOG_E("SNI")
        return JM_ERR_NOT_READY;
    }

    JM_LOG_D("other_packet type=%u",type); 

