mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
    //jm_buf_t* buf = jm_other_buf(type, 0);

    uint16_t len = 4 + payload_len;

   // uint8_t header = PCK_HEANDER;
    //g_ctx.config->uart_send(&header, 1);

    uint8_t byte0 = (len>>8) & 0xFF;
   // g_ctx.config->uart_send(&byte0, 1);//长度高字节

    uint8_t byte1 = len & 0xFF;
    //g_ctx.config->uart_send(&byte1, 1);//长度低字节

    uint8_t reqId =  jm_stm32_next_req_id();
	
    uint8_t data[] = { PCK_HEANDER, byte0, byte1, reqId, 0, 0, JM_SDADA_CHECK_NUM, type};
    g_ctx.config->uart_send(data, sizeof(data)); //协议请求ID,如果reqId为0，则表示是对方返回的确认包

    //JM_LOG_D("sd [%x,%x,%x,%x,%x,%x,%x]", data[0], data[1], data[2], data[3],data[4],data[5],data[6],data[7]); 

   // g_ctx.config->uart_send(data, 4);

    if (payload_len > 0 && payload) {
        g_ctx.config->uart_send(payload, payload_len);
    }

    return JM_SUCCESS;
}
*/

/**
 * @brief 创建串口控制命令缓冲区
 * @param subType 子类型
 * @param msgId   消息 ID
 * @param size    额外数据大小
 * @return 缓冲区指针
 */
static jm_buf_t* jm_serial_buf(uint16_t subType, uint16_t msgId, uint16_t size) {

    jm_buf_t *hbuf = jm_other_buf(JM_SERIALNET_TYPE_SERIAL, size+5);
    if(hbuf == NULL) {
 		JM_LOG_E("hbuf N");
 		return NULL;
 	}

 	jm_buf_put_u16(hbuf, subType);
 	jm_buf_put_u16(hbuf, msgId);

 	return hbuf;
}

/**
 * @brief 发送串口控制命令数据包（Type=3）
 *
 * 构造完整串口数据包：[包头][长度][reqId][0,0][0x55][3][subtype][reqId][payload]
 * 并通过 uart_send 发送到 ESP8266。
 *
 * @param subtype     子类型（@ref JM_TASK_APP_PROXY_*）
 * @param msg_id      消息 ID
 * @param payload     数据负载
 * @param payload_len 负载长度
 * @return @ref JM_SUCCESS 成功，@ref JM_ERR_NOT_READY 未初始化
 */
int jm_send_serial_packet(uint16_t subtype, uint16_t msg_id, const uint8_t *payload, uint16_t payload_len)
{
    if (!g_ctx.initialized || !g_ctx.config->uart_send) {
        JM_LOG_E("SNI")
        return JM_ERR_NOT_READY;
    }

    JM_LOG_D("serial_packet %d msg_id=%u",subtype, msg_id); 

   
    jm_buf_t* buf = jm_serial_buf(subtype, msg_id, 0);
    uint16_t len = jm_buf_readable_len(buf) + payload_len;

    uint8_t byte0 = (len>>8) & 0xFF;
    //g_ctx.config->uart_send(&byte0, 1);//长度高字节

    uint8_t byte1 = len & 0xFF;
    //g_ctx.config->uart_send(&byte1, 1);//长度低字节

    uint8_t reqId =  jm_stm32_next_req_id();

	//g_ctx.config->uart_send(&reqId, 1);//协议请求ID,如果reqId为0，则表示是对方返回的确认包

   // JM_LOG_D("sd [%x,%x,%x,%x,%x,%x,%x]",byte0,byte1, reqId, buf->data[0], buf->data[1], buf->data[2], buf->data[3]); 

    uint8_t data[] = { PCK_HEANDER, byte0, byte1, reqId};
    g_ctx.config->uart_send(data, sizeof(data)); //协议请求ID,如果reqId为0，则表示是对方返回的确认包
    //JM_LOG_D("sd [%x,%x,%x,%x,%x,%x,%x]", data[0], data[1], data[2], data[3],buf->data[0],buf->data[1],buf->data[2]); 

    g_ctx.config->uart_send(buf->data, jm_buf_readable_len(buf));

    if (payload_len > 0 && payload) {
        g_ctx.config->uart_send(payload, payload_len);
    }

    jm_buf_release(buf);

    //JM_LOG_D("roOP"); 

    return JM_SUCCESS;
}

/**
 * @brief 发送控制命令响应结果
 * @param req_id 对应请求的 ID
 * @param rst    响应 emap 容器
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_ctrl_rst(uint16_t req_id, jm_emap_t *rst) {
    if (!rst) return JM_ERR_INVALID_PACKET;
    jm_buf_t *buf = jm_buf_create(128);
    if (!buf) return JM_ERR_MEMORY;
    if (!jm_emap_encode(rst, buf)) {
        jm_buf_release(buf);
        return JM_ERR_MEMORY;
    }
   
    uint16_t rlen = jm_buf_readable_len(buf);
    const uint8_t *rdata = jm_buf_read_buf(buf);

    JM_LOG_D("ctrl_rst %d reqId=%u",rlen, req_id); 
    int ret = jm_send_serial_packet(JM_TASK_APP_PROXY_CTRL_RST, req_id, rdata, rlen);
    jm_buf_release(buf);
    return ret;
}

/**
 * @brief 发送设备 UID 到 ESP8266
 *
 * 从 STM32 唯一 ID 寄存器读取芯片序列号，计算哈希后连同板型和设备类型名称
 * 通过串口发送给 ESP8266。
 *
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_uid()
{

    uint32_t uid = get_unique_id();
    uint16_t board_type = 4;
    const char *device_type_name = "STM32";

    uint16_t name_len = device_type_name ? (uint16_t)strlen(device_type_name) : 0;
    uint16_t payload_len = 6 + name_len;
    uint8_t *payload = (uint8_t *)malloc(payload_len);
    if (!payload) return JM_ERR_MEMORY;

    payload[0] = (uint8_t)((uid >> 24) & 0xFF);
    payload[1] = (uint8_t)((uid >> 16) & 0xFF);
    payload[2] = (uint8_t)((uid >> 8) & 0xFF);
    payload[3] = (uint8_t)(uid & 0xFF);

    payload[4] = (uint8_t)((board_type >> 8) & 0xFF);
    payload[5] = (uint8_t)(board_type & 0xFF);

    if (name_len > 0) {
        memcpy(&payload[6], device_type_name, name_len);
    }

    int ret = jm_send_serial_packet(JM_TASK_APP_PROXY_UID, 0, payload, payload_len);
    free(payload);
    return ret;
}

/**
 * @brief 配置 WiFi 凭据（SSID + 密码）
 * @param ssid WiFi 名称（可为 NULL）
 * @param pwd  WiFi 密码（可为 NULL）
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_wifi_cfg(const char *ssid, const char *pwd)
{
    uint16_t ssid_len = ssid ? (uint16_t)strlen(ssid) : 0;
    uint16_t pwd_len = pwd ? (uint16_t)strlen(pwd) : 0;
    uint16_t payload_len = ssid_len + pwd_len;
    uint8_t *payload = (uint8_t *)malloc(payload_len);
    if (!payload) return JM_ERR_MEMORY;

    if (ssid_len > 0) memcpy(payload, ssid, ssid_len);
    if (pwd_len > 0) memcpy(payload + ssid_len, pwd, pwd_len);

    int ret = jm_send_serial_packet(JM_TASK_APP_PROXY_WIFI_CFG, 0, payload, payload_len);
    free(payload);
    return ret;
}

/**
 * @brief 请求查询 WiFi 连接状态
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_wifi_status_req(void)
{
    return jm_send_serial_packet(JM_TASK_APP_PROXY_WIFI_CONNECTED, 0, NULL, 0);
}

/**
 * @brief 请求查询互联网连接状态
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_internet_status_req(void)
{
    return jm_send_serial_packet(JM_TASK_APP_PROXY_INTERNET_ENABLE, 0, NULL, 0);
}

/**
 * @brief 发起登录请求到 JM 平台
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_login(void)
{
    return jm_send_serial_packet(JM_TASK_APP_PROXY_LOGIN, 0, NULL, 0);
}

#if JM_STM32_TCP_ENABLE==1

/**
 * @brief 发起 TCP 连接
 * @param host 目标主机名或 IP 地址
 * @param port 目标端口
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_tcp_connect(const char *host, uint16_t port)
{

    jm_buf_t *buf = jm_buf_create(32);
    if (!buf) return JM_ERR_MEMORY;

