mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
    jm_buf_write_string(buf, host, strlen(host));
    jm_buf_put_u16(buf,port);
   
    uint16_t rlen = jm_buf_readable_len(buf);
    const uint8_t *rdata = jm_buf_read_buf(buf);

    JM_LOG_D("tcp_connect %s:%u dl=%d",host, port, rlen); 
    int ret = jm_send_serial_packet(JM_TASK_APP_PROXY_TCP_CONN, 0, rdata, rlen);
    jm_buf_release(buf);
    return ret;

}

/**
 * @brief 关闭 TCP 连接
 * @param sock 套接字描述符
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_tcp_close(int8_t sock)
{
    uint8_t payload[1];
    payload[0] = (uint8_t)sock;
    return jm_send_serial_packet(JM_TASK_APP_PROXY_TCP_CLOSE, 0, payload, 1);
}

/**
 * @brief 通过已建立的 TCP 连接发送数据
 *
 * 直接发送 TCP 数据包（Type=2）到 ESP8266，由 ESP8266 通过 TCP 连接转发。
 *
 * @param sock  套接字描述符
 * @param data  数据指针
 * @param len   数据长度
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_tcp_data(int8_t sock, const uint8_t *payload, uint16_t plen)
{
    if (!g_ctx.initialized || !g_ctx.config->uart_send) {
        JM_LOG_E("SNI")
        return JM_ERR_NOT_READY;
    }

    uint16_t len = 5 + plen;

    uint8_t byte0 = (len>>8) & 0xFF;
    uint8_t byte1 = len & 0xFF;

    uint8_t reqId = jm_stm32_next_req_id();

    uint8_t data[] = {
        PCK_HEANDER,
        byte0, ////长度高字节
        byte1, //长度低字节
        reqId , //数据包ID
        0, 0, //组包类型，0，0不需要重组包
        JM_SDADA_CHECK_NUM, //校验和
        JM_SERIALNET_TYPE_TCP, //TCB数据包
        sock //socket连接标识
    };

    //JM_LOG_D("sd [%x,%x,%x,%x,%x,%x,%x]",data[0], data[1], data[2], data[3], data[4], data[5], data[6], data[7]); 

    g_ctx.config->uart_send(data, sizeof(data));//协议请求ID,如果reqId为0，则表示是对方返回的确认包

    if (plen > 0 && payload) {
        g_ctx.config->uart_send(payload, plen);
    }

    return JM_SUCCESS;
}

#endif //#if JM_STM32_TCP_ENABLE==1


#if JM_STM32_UDP_ENABLE==1

/**
 * @brief 通过 UDP 发送数据
 * @param host  目标主机名或 IP 地址
 * @param port  目标端口
 * @param data  数据指针
 * @param len   数据长度
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_udp_data(const char *host, uint16_t port, const uint8_t *payload, uint16_t plen)
{
    if (!g_ctx.initialized || !g_ctx.config->uart_send) {
        JM_LOG_E("SNI")
        return JM_ERR_NOT_READY;
    }

    jm_buf_t *buf = jm_buf_create(24);
    if (!buf) return JM_ERR_MEMORY;

    jm_buf_put_u16(buf, 0);//两个字节的头部长度，都是0给不拆包
    jm_buf_put_u8(buf, JM_SDADA_CHECK_NUM);
    jm_buf_put_u8(buf, JM_SERIALNET_TYPE_UDP_COM);

    jm_buf_write_string(buf,host, strlen(host));
    jm_buf_put_u16(buf, port);


    uint16_t len = jm_buf_readable_len(buf) + plen;

    uint8_t byte0 = (len>>8) & 0xFF;
    uint8_t byte1 = len & 0xFF;

    uint8_t reqId = jm_stm32_next_req_id();

    uint8_t data[] = { PCK_HEANDER, byte0, byte1, reqId};

    g_ctx.config->uart_send(data, sizeof(data));

    g_ctx.config->uart_send(jm_buf_read_buf(buf), jm_buf_readable_len(buf));

    if (plen > 0 && payload) {
        g_ctx.config->uart_send(payload, plen);
    }

    return JM_SUCCESS;
}

#endif //JM_STM32_UDP_ENABLE


/**
 * @brief 发送语音播放文本
 * @param text 待播放的文本内容
 * @return @ref JM_SUCCESS 成功
 */
int jm_stm32_send_audio_play(const char *text)
{
    uint16_t len = text ? (uint16_t)strlen(text) : 0;
    return jm_send_serial_packet(JM_TASK_APP_PROXY_AUDIO_PLAY, 0, (const uint8_t *)text, len);
}

/**
 * @brief 发送控制事件到 ESP8266
 * @param data 事件数据
 * @param len  数据长度
 * @return @ref JM_SUCCESS 成功，@ref JM_ERR_INVALID_PACKET 参数无效
 */
int jm_stm32_send_ctrl_event(const uint8_t *data, uint16_t len)
{
    if (!data || len == 0) return JM_ERR_INVALID_PACKET;
    return jm_send_serial_packet(JM_TASK_APP_PROXY_CTRL_EVENT, 0, data, len);
}

int jm_stm32_send_cardmem()
{
    return jm_send_serial_packet(JM_TASK_APP_PROXY_MEMINFO, 0, NULL, 0);
}


#if JM_LOG_DEBUG_ENABLE || JM_LOG_ERROR_ENABLE
#include <stdio.h>

/* ===================== 日志输出 ===================== */

/**
 * @brief 通过 uart_send_log 发送单个字符
 * @param ch 字符
 */
void jm_log_char(char ch)
{
    if (!g_ctx.initialized || !g_ctx.config->uart_send_log) return;
    const uint8_t c = (uint8_t)ch;
    if (g_ctx.config->uart_send_log) {
        g_ctx.config->uart_send_log(&c, 1);
    }
    
    /*else if (g_ctx.config->uart_send) {
        g_ctx.config->uart_send(&c, 1);
    }*/
}

/**
 * @brief 通过 uart_send_log 发送格式化日志
 * @param format 格式化字符串
 * @param ... 可变参数
 */
void jm_log_print(const char *format, ...)
{
    if (!g_ctx.initialized  || !g_ctx.config->uart_send_log) return;

    char buf[128];
    va_list args;
    va_start(args, format);
    int len = vsnprintf(buf, sizeof(buf), format, args);
    va_end(args);

    if (len <= 0) return;

    if (len >= (int)sizeof(buf)) {
        len = sizeof(buf) - 1;
    }

    if (g_ctx.config->uart_send_log) {
        g_ctx.config->uart_send_log((const uint8_t *)buf, (uint16_t)len);
    }/* else if (g_ctx.config->uart_send) {
        g_ctx.config->uart_send((const uint8_t *)buf, (uint16_t)len);
    }*/
}
#endif

/**
 * @brief 通过 uart_send 直接发送数据
 * @param data 数据指针
 * @param len  数据长度
 * @return @ref JM_SUCCESS 成功，@ref JM_ERR_NOT_READY 未初始化
 */
int jm_stm32_uart_send(const uint8_t *data, uint16_t len) {
    if (!g_ctx.initialized || !g_ctx.config->uart_send) {
        return JM_ERR_NOT_READY;
    }
    g_ctx.config->uart_send(data, len);
    return JM_SUCCESS;
}

#if JM_STM32_EVENT_ENABLE

/* ===================== Event 系统 ===================== */

#define JM_STM32_EVENT_QUEUE_SIZE 10
#define JM_MAX_EVENT_LISTENERS 8

typedef void (*jm_event_listener_fn)(jm_event_t *event);

static jm_event_t eventQueue[JM_STM32_EVENT_QUEUE_SIZE];
static uint8_t eventQueueHead = 0;
static uint8_t eventQueueTail = 0;
static bool eventQueueEmpty = true;

/** @brief 最大事件监听器数量 */

/**
 * @brief 事件监听器注册表项
 */
typedef struct {
    uint8_t eventType;          /**< 监听的事件类型 */
    jm_event_listener_fn callback; /**< 回调函数 */
    bool active;                /**< 是否激活 */
} jm_event_listener_entry_t;

/** @brief 事件监听器注册表 */
static jm_event_listener_entry_t eventListeners[JM_MAX_EVENT_LISTENERS];

/**
 * @brief 将本地事件上行转发到 ESP8266 netproxy
 * @param e 事件指针
 * @return true 成功
 */
bool jm_stm32_transEventToCard(jm_event_t *e) {

    //e->type, e->subType, e->data, g_ctx.config->user_data
    uint8_t eventType =e->type; 
    uint16_t subType = e->subType; 
    jm_emap_t *ps =e->data; 
    uint8_t flag = e->flag;

    jm_buf_t *hbuf = jm_buf_create(128);
 	if(hbuf == NULL) {
 		JM_LOG_E("hbuf N");
 		return NULL;
 	}

 	//两个0总长度表示不拆包，也就是本地命令包长度不能大于JM_MAX_SERIAL_BLOCK_SIZE
    jm_buf_put_u8(hbuf, flag);
 	jm_buf_put_u8(hbuf, eventType);
 	jm_buf_put_u16(hbuf, subType);

	if(ps && !jm_emap_encode(ps,hbuf)) {
		JM_LOG_E("transEvent encode MO");
		jm_buf_release(hbuf);
		return false;
	}

	jm_send_serial_packet(JM_TASK_APP_PROXY_NETCARD_EVENT, 0, (uint8_t*) hbuf->data, jm_buf_readable_len(hbuf));

