mynewworldyyl/jm_stm32_ext/jm_stm32/src/jm_stm32.c
	jm_buf_release(hbuf);

	JM_LOG_D("transEvent E");
	return true;	
}

/**
 * @brief 投递事件到异步事件队列
 * @param eventType 事件类型
 * @param subType   子类型
 * @param data      事件数据
 * @param flag      内存管理标志
 * @return true 成功入队，false 队列已满
 */
bool jm_stm32_postEvent(uint8_t eventType, uint16_t subType, void *data, uint8_t flag)
{
    if (eventQueueHead == eventQueueTail && !eventQueueEmpty) {
        return false;
    }

    jm_event_t *e = &eventQueue[eventQueueTail];
    e->type = eventType;
    e->subType = subType;
    e->data = data;
    e->flag = flag;
    eventQueueTail = (eventQueueTail + 1) % JM_STM32_EVENT_QUEUE_SIZE;
    if (eventQueueHead == eventQueueTail) {
        eventQueueEmpty = false;
    }
    return true;
}

/**
 * @brief 注册事件监听器
 * @param eventType 监听的事件类型
 * @param callback  回调函数
 * @return true 成功，false 失败
 */
bool jm_stm32_regEventListener(uint8_t eventType, jm_event_listener_fn callback)
{
    for (int i = 0; i < JM_MAX_EVENT_LISTENERS; i++) {
        if (eventListeners[i].active &&
            eventListeners[i].eventType == eventType &&
            eventListeners[i].callback == callback) {
            return true;
        }
    }

    for (int i = 0; i < JM_MAX_EVENT_LISTENERS; i++) {
        if (!eventListeners[i].active) {
            eventListeners[i].eventType = eventType;
            eventListeners[i].callback = callback;
            eventListeners[i].active = true;
            return true;
        }
    }
    return false;
}

/**
 * @brief 注销事件监听器
 * @param eventType 事件类型
 * @param callback  回调函数
 * @return true 成功，false 失败
 */
bool jm_stm32_unregEventListener(uint8_t eventType, jm_event_listener_fn callback)
{
    for (int i = 0; i < JM_MAX_EVENT_LISTENERS; i++) {
        if (eventListeners[i].active &&
            eventListeners[i].eventType == eventType &&
            eventListeners[i].callback == callback) {
            eventListeners[i].active = false;
            return true;
        }
    }
    return true;
}

/**
 * @brief 调用所有匹配事件类型的监听器
 * @param event 事件指针
 */
static void _jm_invokeEventListener(jm_event_t *event)
{
    for (int i = 0; i < JM_MAX_EVENT_LISTENERS; i++) {
        if (eventListeners[i].active && eventListeners[i].eventType == event->type) {
            eventListeners[i].callback(event);
        }
    }
}

/**
 * @brief 处理异步事件队列
 *
 * 从队列中取出一个事件，若非网卡上行则转发到网卡，
 * 然后调用所有匹配的监听器。
 * 由 @ref jm_stm32_loop 周期性调用。
 */
static void jm_stm32_runEvent(void)
{
    if (eventQueueHead == eventQueueTail && eventQueueEmpty) {
        return;
    }
    jm_event_t *e = &eventQueue[eventQueueHead];
   
    eventQueueHead = (eventQueueHead + 1) % JM_STM32_EVENT_QUEUE_SIZE;
    if (eventQueueHead == eventQueueTail) {
        eventQueueEmpty = true;
    }
    
    if(!(e->flag & JM_EVENT_FLAG_FROM_NETCARD)) {
		//非网卡所连设备上行事件，转发到网卡所连接设备
		//jm_cli_serial_transEventToHost(jevent);
        jm_stm32_transEventToCard(e);
	}

    _jm_invokeEventListener(e);
}

#endif
